/*
问题描述
小椒是个摄影爱好者。恰逢班级合照，他受邀帮忙拍照（站成一排）。这本是一件简单的事，但由于啾啾是个完美主义者，他希望他拍的照片必须符合美学，
即存在一个身高较大值，使得较大值无论是往左还是往右身高都是递减的（数学表示应为：a[1]≤...≤a[i]≥a[i+1]≥...≥a[n]）。
同学们已经站好了，但站位不符合美学，你需要找出尽可能少的同学出队进行重新排列。请问最少需要出队多少个同学？

输入格式
第一行输入 n，表示有 n 个同学。

接下来的 n 行输入校友身高，其中第 i 行输入 a[i](1≤i≤n)，表示编号为 i 的校友的身高（单位：毫米）。

(1≤n≤100,1500≤a[i]≤1900)。

输出描述
输出一个整数，表示最少需要出队多少个同学。

样例输入
6
1700 1701 1702 1703 1704 1705

样例输出
0*/
/*
问题描述
小椒是个摄影爱好者。恰逢班级合照，他受邀帮忙拍照（站成一排）。这本是一件简单的事，但由于啾啾是个完美主义者，他希望他拍的照片必须符合美学，
即存在一个身高较大值，使得较大值无论是往左还是往右身高都是递减的（数学表示应为：a[1]≤...≤a[i]≥a[i+1]≥...≥a[n]）。
同学们已经站好了，但站位不符合美学，你需要找出尽可能少的同学出队进行重新排列。请问最少需要出队多少个同学？

输入格式
第一行输入 n，表示有 n 个同学。

接下来的 n 行输入校友身高，其中第 i 行输入 a[i](1≤i≤n)，表示编号为 i 的校友的身高（单位：毫米）。

(1≤n≤100,1500≤a[i]≤1900)。

输出描述
输出一个整数，表示最少需要出队多少个同学。

样例输入
6
1700 1701 1702 1703 1704 1705

样例输出
0*/
#include <iostream>
#include <algorithm>
using namespace std;
const int maxn = 110;
int n;
int a[maxn], dp1[maxn], dp2[maxn];
int main()
{
    ios::sync_with_stdio(0), cin.tie(0), cout.tie(0);
    cin >> n;
    for (int i = 1; i <= n; i++)
    {
        cin >> a[i];
        dp1[i] = dp2[i] = 1;
    }
    for (int i = 1; i <= n; i++)
    {
        for (int j = 1; j < i; j++)
        {
            if (a[j] <= a[i])
            {
                dp1[i] = max(dp1[i], dp1[j] + 1);
            }
        }
    }
    for (int i = n; i >= 1; i--)
    {
        for (int j = n; j > i; j--)
        {
            if (a[j] <= a[i])
            {
                dp2[i] = max(dp2[i], dp2[j] + 1);
            }
        }
    }
    int Max = 0;
    for (int i = 1; i <= n; i++)
    {
        Max = max(Max, dp1[i] + dp2[i] - 1);
    }
    cout << n - Max << '\n';

    return 0;
}
